MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK21DX256AVLK5/mcu.h
#define IDCHG                         0x00000080      // ID change interrupt
#define ONEMSEC                       0x00000040      // 1 millisecond interrupt
#define LINE_STATE_CHG                0x00000020      // Line state change interrupt
#define SESSVLDCHG                    0x00000008      // Session valid change interrupt
#define B_SESS_CHG                    0x00000004      // B session change interrupt
#define AVBUSCHG                      0x00000001      // A VBUS change interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGICR register.
//
//*****************************************************************************

#define IDEN                          0x00000080      // ID interrupt enable
#define ONEMSECEN                     0x00000040      // 1 millisecond interrupt enable
#define LINESTATEEN                   0x00000020      // Line state change interrupt enable
#define SESSVLDEN                     0x00000008      // Session valid change interrupt enable
#define BSESSEN                       0x00000004      // B session change interrupt enable
#define AVBUSEN                       0x00000001      // A VBUS change interrupt enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGSTAT register.
//
//*****************************************************************************

#define ID                            0x00000080      // ID pin state
#define LINESTATESTABLE               0x00000020      // Line state stable
#define SESS_VLD                      0x00000008      // Session valid
#define BSESSEND                      0x00000004      // B session end
#define AVBUSVLD                      0x00000001      // A VBUS valid


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGCTL register.
//
//*****************************************************************************

#define DPHIGH                        0x00000080      // D+ pullup resistor enable
#define DPLOW                         0x00000020      // D+ pull-down resistor enable
#define DMLOW                         0x00000010      // D- pull-down resistor enable
#define OTGEN                         0x00000004      // OTG enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ISTAT register.
//
//*****************************************************************************

#define STALL                         0x00000080      // Stall interrupt
#define ATTACH                        0x00000040      // Attach interrupt
#define RESUME                        0x00000020      // Resume interrupt
#define SLEEP                         0x00000010      // Sleep interrupt
#define TOKDNE                        0x00000008      // Token done interrupt
#define SOFTOK                        0x00000004      // SOF token interrupt
#define ERROR                         0x00000002      // Error interrupt
#define USBRST                        0x00000001      // USB reset interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_INTEN register.
//
//*****************************************************************************

#define STALLEN                       0x00000080      // Stall interrupt enable
#define ATTACHEN                      0x00000040      // Attach interrupt enable
#define RESUMEEN                      0x00000020      // Resume interrupt enable
#define SLEEPEN                       0x00000010      // Sleep interrupt enable
#define TOKDNEEN                      0x00000008      // Token done interrupt enable
#define SOFTOKEN                      0x00000004      // SOF token interrupt enable
#define ERROREN                       0x00000002      // Error interrupt enable
#define USBRSTEN                      0x00000001      // USB reset interrupt enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERRSTAT register.
//
//*****************************************************************************

#define BTSERR                        0x00000080      // Bit stuff error interrupt
#define DMAERR                        0x00000020      // DMA error interrupt
#define BTOERR                        0x00000010      // Bus turnaround timeout error interrupt
#define DFN8                          0x00000008      // Data field not 8 bits interrupt
#define CRC16                         0x00000004      // CRC16 error interrupt
#define CRC5EOF                       0x00000002      // CRC5/EOF error interrupt
#define PIDERR                        0x00000001      // PID error interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERREN register.
//
//*****************************************************************************

#define BTSERREN                      0x00000080      // Bit stuff error interrupt enable
#define DMAERREN                      0x00000020      // DMA error interrupt enable
#define BTOERREN                      0x00000010      // Bus turnaround timeout error interrupt enable
#define DFN8EN                        0x00000008      // Data field not 8 bits interrupt enable
#define CRC16EN                       0x00000004      // CRC16 error interrupt enable
#define CRC5EOFE                      0x00000002      // CRC5/EOF error interrupt enable
#define PIDERREN                      0x00000001      // PID error interrupt enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_STAT register.
//
//*****************************************************************************

